balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1824.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP3CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP3CON" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3M0" edc:desc="" edc:mask="0x1" edc:name="CCP3M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M1" edc:desc="" edc:mask="0x1" edc:name="CCP3M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M2" edc:desc="" edc:mask="0x1" edc:name="CCP3M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M3" edc:desc="" edc:mask="0x1" edc:name="CCP3M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC3B0" edc:desc="" edc:mask="0x1" edc:name="DC3B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC3B1" edc:desc="" edc:mask="0x1" edc:name="DC3B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP3M" edc:desc="" edc:mask="0xf" edc:name="CCP3M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC3B" edc:desc="" edc:mask="0x3" edc:name="DC3B" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR4L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR4L" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR4L" edc:desc="" edc:mask="0xff" edc:name="CCPR4L" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR4H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR4H" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR4H" edc:desc="" edc:mask="0xff" edc:name="CCPR4H" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP4CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP4CON" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP4M0" edc:desc="" edc:mask="0x1" edc:name="CCP4M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4M1" edc:desc="" edc:mask="0x1" edc:name="CCP4M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4M2" edc:desc="" edc:mask="0x1" edc:name="CCP4M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4M3" edc:desc="" edc:mask="0x1" edc:name="CCP4M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC4B0" edc:desc="" edc:mask="0x1" edc:name="DC4B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC4B1" edc:desc="" edc:mask="0x1" edc:name="DC4B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP4M" edc:desc="" edc:mask="0xf" edc:name="CCP4M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC4B" edc:desc="" edc:mask="0x3" edc:name="DC4B" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="7" edc:beginaddr="0x380" edc:endaddr="0x3A0" edc:regionid="sfr7">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INLVLA" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000100" edc:name="INLVLA" edc:nzwidth="8" edc:por="--000100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLA0" edc:desc="" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA1" edc:desc="" edc:mask="0x1" edc:name="INLVLA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA2" edc:desc="" edc:mask="0x1" edc:name="INLVLA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA3" edc:desc="" edc:mask="0x1" edc:name="INLVLA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA4" edc:desc="" edc:mask="0x1" edc:name="INLVLA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA5" edc:desc="" edc:mask="0x1" edc:name="INLVLA5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INLVLA" edc:desc="" edc:mask="0x3f" edc:name="INLVLA" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INLVLC" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="INLVLC" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLC0" edc:desc="" edc:mask="0x1" edc:name="INLVLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC1" edc:desc="" edc:mask="0x1" edc:name="INLVLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC2" edc:desc="" edc:mask="0x1" edc:name="INLVLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC3" edc:desc="" edc:mask="0x1" edc:name="INLVLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC4" edc:desc="" edc:mask="0x1" edc:name="INLVLC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLC5" edc:desc="" edc:mask="0x1" edc:name="INLVLC5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INLVLC" edc:desc="" edc:mask="0x3f" edc:name="INLVLC" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAP" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAP0" edc:desc="" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP1" edc:desc="" edc:mask="0x1" edc:name="IOCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP2" edc:desc="" edc:mask="0x1" edc:name="IOCAP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP3" edc:desc="" edc:mask="0x1" edc:name="IOCAP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP4" edc:desc="" edc:mask="0x1" edc:name="IOCAP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAP5" edc:desc="" edc:mask="0x1" edc:name="IOCAP5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAP" edc:desc="" edc:mask="0x3f" edc:name="IOCAP" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
