balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1824.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAN" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:desc="" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:desc="" edc:mask="0x1" edc:name="IOCAN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:desc="" edc:mask="0x1" edc:name="IOCAN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:desc="" edc:mask="0x1" edc:name="IOCAN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:desc="" edc:mask="0x1" edc:name="IOCAN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:desc="" edc:mask="0x1" edc:name="IOCAN5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAN" edc:desc="" edc:mask="0x3f" edc:name="IOCAN" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAF" edc:desc="Interrupt-On-Change Flag Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAF" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:desc="" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:desc="" edc:mask="0x1" edc:name="IOCAF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:desc="" edc:mask="0x1" edc:name="IOCAF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:desc="" edc:mask="0x1" edc:name="IOCAF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:desc="" edc:mask="0x1" edc:name="IOCAF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:desc="" edc:mask="0x1" edc:name="IOCAF5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAF" edc:desc="" edc:mask="0x3f" edc:name="IOCAF" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLKRCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00110000" edc:name="CLKRCON" edc:nzwidth="8" edc:por="00110000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV0" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV1" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV2" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC0" edc:desc="" edc:mask="0x1" edc:name="CLKRDC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC1" edc:desc="" edc:mask="0x1" edc:name="CLKRDC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRSLR" edc:desc="" edc:mask="0x1" edc:name="CLKRSLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKROE" edc:desc="" edc:mask="0x1" edc:name="CLKROE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKREN" edc:desc="" edc:mask="0x1" edc:name="CLKREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV" edc:desc="" edc:mask="0x7" edc:name="CLKRDIV" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CLKRDC" edc:desc="" edc:mask="0x3" edc:name="CLKRDC" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnn--n" edc:cname="MDCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00100--0" edc:name="MDCON" edc:nzwidth="8" edc:por="00100--0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MDBIT" edc:desc="" edc:mask="0x1" edc:name="MDBIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MDOUT" edc:desc="" edc:mask="0x1" edc:name="MDOUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDOPOL" edc:desc="" edc:mask="0x1" edc:name="MDOPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDSLR" edc:desc="" edc:mask="0x1" edc:name="MDSLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDOE" edc:desc="" edc:mask="0x1" edc:name="MDOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDEN" edc:desc="" edc:mask="0x1" edc:name="MDEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="MDSRC" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u---uuuu" edc:name="MDSRC" edc:nzwidth="8" edc:por="x---xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MDMS0" edc:desc="" edc:mask="0x1" edc:name="MDMS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDMS1" edc:desc="" edc:mask="0x1" edc:name="MDMS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDMS2" edc:desc="" edc:mask="0x1" edc:name="MDMS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDMS3" edc:desc="" edc:mask="0x1" edc:name="MDMS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="MDMSODIS" edc:desc="" edc:mask="0x1" edc:name="MDMSODIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDMS" edc:desc="" edc:mask="0xf" edc:name="MDMS" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
